# StairGet2D3DCompType

## Description
Returns 2D3D components type of stair.

```pascal
FUNCTION StairGet2D3DCompType(stair : HANDLE) : INTEGER;
```

```python

def vs.StairGet2D3DCompType(stair):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|stair|HANDLE||

## Version
Availability: from Vectorworks 2021
## Category
* Objects - Stairs